# PathReinSummary Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..PathReinSummary Property
ParameterTypeId Class See Also
---
"Summary"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId PathReinSummary { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PathReinSummary As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ PathReinSummary {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace